/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   07_timeout_test.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yabukirento <yabukirento@student.42.fr>    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/05/23 22:15:00 by yabukirento       #+#    #+#             */
/*   Updated: 2025/05/23 20:44:57 by yabukirento      ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libunit.h"

int timeout_test(void)
{
    // 無限ループを作成してタイムアウトを発生させる
    while (1)
        ;
    return (0); // この行は実行されない
}